InformationRegisters/СостоянияВыгрузкиВЦентрЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостоянияВыгрузкиВЦентрЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗавершенияРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументовВыгружено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументовОсталось</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиИнтеграцииЦентраЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиИнтеграцииЦентраЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УчетнаяЗаписьЦентраЭДО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЦентровЭДО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяЗавершитьПереходВЦентрЭДО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СостоянияВыгрузкиВЦентрЭДО/Forms/ПросмотрСостояния/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИдентификаторЭДО = Параметры.ИдентификаторЭДО;
	Если Не ЗначениеЗаполнено(ИдентификаторЭДО) Тогда
		ВызватьИсключение НСтр("ru = 'Не указан идентификатор учетной записи ЭДО'");
	КонецЕсли;
	
	УчетнаяЗаписьЦентраЭДО = РегистрыСведений.НастройкиИнтеграцииЦентраЭДО.УчетнаяЗаписьЦентраЭДО(ИдентификаторЭДО);
	Если Не ЗначениеЗаполнено(УчетнаяЗаписьЦентраЭДО) Тогда
		ВызватьИсключение НСтр("ru = 'Не указана учетная запись центра ЭДО'");
	КонецЕсли;
	
	Статистика = РегистрыСведений.СостоянияВыгрузкиВЦентрЭДО.СостояниеПоИдентификаторуЭДО(ИдентификаторЭДО);
	
	ЗаполнитьРеквизитыФормыПоДаннымСостояния(ЭтотОбъект, Статистика);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(ДатаЗавершения) Тогда
		ПодключитьОбработчикОжидания("ОбновитьСостояниеПереходаВСервис", 5, Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура Отмена(Команда)
	
	Ответ = Ждать ВопросАсинх(НСтр("ru = 'Выгрузка будет прекращена. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Состояние = ОтменитьВыгрузку(ИдентификаторЭДО);
		ЗаполнитьРеквизитыФормыПоДаннымСостояния(ЭтотОбъект, Состояние);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьСостояниеПереходаВСервис()
	
	Состояние = СостояниеПоУчетнойЗаписи(ИдентификаторЭДО);
	
	ЗаполнитьРеквизитыФормыПоДаннымСостояния(ЭтотОбъект, Состояние);
	
	Если ЗначениеЗаполнено(ДатаЗавершения) Тогда
		ОтключитьОбработчикОжидания("ОбновитьСостояниеПереходаВСервис");
		Элементы.ДатаЗавершения.Видимость = Истина;
		Элементы.ОсталосьВремени.Видимость = Ложь;
		Элементы.Прогресс.Видимость = Ложь;
		Элементы.Отмена.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  ИдентификаторЭДО - Строка
// 
// Возвращаемое значение:
//  См. РегистрыСведений.СостоянияВыгрузкиВЦентрЭДО.СостояниеПоИдентификаторуЭДО
&НаСервереБезКонтекста
Функция СостояниеПоУчетнойЗаписи(Знач ИдентификаторЭДО)
	
	Возврат РегистрыСведений.СостоянияВыгрузкиВЦентрЭДО.СостояниеПоИдентификаторуЭДО(ИдентификаторЭДО);
	
КонецФункции

// Параметры:
//  Форма - см. РегистрСведений.СостоянияВыгрузкиВЦентрЭДО.Форма.ПросмотрСостояния
//  Состояние - см. РегистрыСведений.СостоянияВыгрузкиВЦентрЭДО.СостояниеПоИдентификаторуЭДО
&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьРеквизитыФормыПоДаннымСостояния(Форма, Состояние)
	
	Форма.ДатаНачала = Состояние.ДатаНачала;
	Форма.ДатаЗавершения = Состояние.ДатаЗавершения;
	Форма.ОсталосьВремени = Состояние.ОсталосьВремени;
	Форма.Прогресс = Состояние.Прогресс;
	Форма.ДокументовВыгружено = Состояние.ДокументовВыгружено;
	Форма.ДокументовОсталось = Состояние.ДокументовОсталось;
	
КонецПроцедуры

// Параметры:
//  ИдентификаторЭДО - Строка
// 
// Возвращаемое значение:
//  См. РегистрыСведений.СостоянияВыгрузкиВЦентрЭДО.СостояниеПоИдентификаторуЭДО
&НаСервереБезКонтекста
Функция ОтменитьВыгрузку(Знач ИдентификаторЭДО)
	
	ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДО.ОтменитьВыгрузкуВЦентрЭДО(ИдентификаторЭДО);
	
	Возврат РегистрыСведений.СостоянияВыгрузкиВЦентрЭДО.СостояниеПоИдентификаторуЭДО(ИдентификаторЭДО);
	
КонецФункции

#КонецОбласти
